Repository: 84000/data-translation-memory
Catalog: toh229-v4.tmx
Source language: bo
Languages: en

source: ཁྱིམ་བདག་དཔའ་བོ་དཔལ་དང་། དཔའ་བོའི་འགྲོས་ཀྱིས་འགྲོ་བ་དང་། དགའ་བྱེད་དང་། དག་པའི་སེམས་དང་། དོན་གྲུབ་དང་། ཀུན་འཛིན་རྣམས་ལ་ཡང་སྦྲོན་ཅིག །
en: Summon the householder Vīraśrī, the householder Moves with a Hero’s Gait, Nandika, Pristine Mind, Amoghasiddhi, and Āgraha as well.

source: ཁྱིམ་བདག་བཀོད་པའི་མཆོག་ལ་ཡང་སྦྲོན་ཅིག །ཁྱིམ་བདག་རྣ་གཙུག་ལ་ཡང་སྦྲོན་ཅིག །ཁྱིམ་བདག་རྣ་ཆ་ཅན་ལ་ཡང་སྦྲོན་ཅིག །ཁྱིམ་བདག་མེ་ཏོག་རྣ་ཅན་ལ་ཡང་སྦྲོན་ཅིག །
en: Summon the householder Greatest Array, the householder Peaked Ears, the householder Bearing Earrings, and the householder Bearing Flower Earrings.

source: བཅོམ་ལྡན་འདས་ལ་ཕྱག་བྱ་བ་དང་། བལྟ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འདོང་དགོས་ཀྱིས།
en: Tell them they must go to honor, meet, and serve the Blessed One.

source: ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོས་བཀའ་སྩལ་པ་བཞིན་དེ་ལྟར་གོ་མ་ཐག་ཏུ་གྲོགས་པོ་དག་དེང་ཤིག །
en: Tell them, ‘Friends, as soon as you hear this command of King Prasenajit of Kośala you must depart.

source: གྲོགས་པོ་དག་དེང་ཤིག །
en: Friends, you must depart.’ ”

source: དེ་ལྟར་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་རྩིས་པ་ས་ག་བཟང་པོས་ཀྱང་རྒྱལ་པོ་ཆེན་པོའི་ལྟར་མཉན་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ཇི་སྐད་བསྒོ་བ་བཞིན་བསྒྲགས་སོ། །
en: The court astrologer Suviśākhā then conveyed the command of King Prasenajit just as he had heard it from the great king.

source: དེ་ནས་བཙུན་མོ་ཕྲེང་ཐོགས་ཀྱིས་བྲན་མོ་དཔལ་བཟང་མོ་དང་། བྲན་མོ་མེ་ཏོག་དཔལ་དང་། བྲན་མོ་དཔལ་དགའ་མོ་རྣམས་ལ་སྨྲས་པ། ཁྱོད་དེང་ལ་ང་ན་རེ་ཁྱིམ་བདག་གི་ཆུང་མ་རབ་ཏུ་རྟོག་བྱེད་ལ། བཅོམ་ལྡན་འདས་ལ་ཕྱག་བྱ་བ་དང་། བལྟ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འདོང་དགོས་སོ་ཞེས་སྦྲོན་ཅིག །
en: Queen Mālādhārā then addressed her maids Noble Kind Lady, Kusumaśrī, and Noble Joyous Lady, “Go to the wives of the householders and convey my message that they must go to honor, meet, and serve the Blessed One.

source: ངའི་ཚིག་གིས་ཁྱིམ་བདག་གི་ཆུང་མ་ཟླ་བ་དང་། དྲི་མེད་དང་། བདེ་དཔལ་དང་། འཕགས་མ་དང་། ཀུན་ཤེས་དང་། དཔེ་མེད་དཔལ་དང་། བཀོད་མཆོག་མ་དང་། ཟླ་བཟངས་མ་དང་། དྲི་མེད་ལྡན་རྣམས་ལ་ཡང་སྦྲོན་ཅིག །
en: With my words, summon the householders’ wives Candrā, Vimalā, Noble Bliss, Āryā, All-Knowing, Matchless Noble One, Lady of the Great Array, Sucandrā, and Stainless Quality.”

source: གནང་ཆེན་མོ་དེ་དག་གིས་ཇོ་མོ་ལེགས་སོ་ཞེས་ཇོ་མོའི་ལྟར་མཉན་ནས་ཇི་སྐད་བསྒོ་བ་བཞིན་སྦྲན་ཏོ།
en: Her companions said, “Yes, Queen,” and they conveyed the command of the queen just as they had heard it.

source: །དེ་ནས་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་དབྱིབས་རིང་གིས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་བཞོན་པ་བཟང་པོ་བཤམས་སོ། །བཤམས་ནས་ཀྱང་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷའི་བཅིབས་པ་བཟང་པོ་ནི་བཤམས་ལགས་སོ།
en: When King Prasenajit’s finest carriage had been prepared, the minister Long Shape went to King Prasenajit of Kośala and said, “Your highness’ finest mounts are ready.”

source: །དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས། བཅོམ་ལྡན་འདས་ལ་ཕྱག་བྱ་བ་དང་། བལྟ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་བཞོན་པ་བཟང་པོ་ལ་ཞོན་ཏེ། རྒྱལ་པོ་ཆེན་པོའི་མཐུ་དང་།
en: King Prasenajit of Kośala then mounted the fine carriage so that he could go to honor, meet, and serve the Blessed One.

source: རྒྱལ་པོ་ཆེན་པོའི་རྫུ་འཕྲུལ་གྱིས་བཙུན་མོའི་འཁོར་གྱི་ནང་ན་གནས་ཤིང་། བཙུན་མོའི་འཁོར་གྱིས་མདུན་གྱིས་ནི་བལྟས།
en: In his power and splendor, the great king was surrounded and venerated by his retinue of consorts.

source: ལྗོངས་ཀྱི་མི་དང་། གྲོང་རྡལ་བས་ནི་བསྐོར། ཡན་ལག་བཞི་པའི་དཔུང་གི་ཚོགས་ཀྱིས་ནི་མདུན་གྱིས་བལྟས།
en: He was also surrounded by the country people as well as the townspeople and venerated by his army of the four kinds of troops.

source: མེ་ཏོག་དང་། མེ་ཏོག་ཕྲེང་དང་། བདུག་པ་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གདུགས་དང་།
en: They brought flowers, flower garlands, incense, perfume, wreaths, ointments, powders, umbrellas, banners, flags, and garments.

source: རྒྱལ་མཚན་དང་། བ་དན་དང་། གོས་དག་ནི་ཐོགས། རིན་པོ་ཆེའི་གོས་རིན་ཏང་མེད་པ་དག་ནི་ཁྱེར། རིན་པོ་ཆེའི་གོས་རྒྱ་ཆེ་ཞིང་ཡངས་པ་དག་ནི་བགོས།
en: The king carried precious and priceless clothing and was clad in broad and extensive precious clothing.

source: ཤིང་རྟ་སྟོང་ཕྲག་དྲུག་ཁྲི་དང་། ཁྱོགས་པ་སྟོང་ཕྲག་དྲུག་ཁྲི་དང་། རྐང་ཏང་པ་སྟོང་ཕྲག་དྲུག་ཁྲིས་ནི་བསྐོར།
en: He was surrounded by sixty thousand chariots, sixty thousand palanquins, and sixty thousand people on foot.

source: བ་དན་སྟོང་ཕྲག་དྲུག་ཁྲི་ནི་བསྒྲེང་། རོལ་མོའི་སྒྲ་སྟོང་ཕྲག་དྲུག་ཁྲི་དང་། རྔ་བོ་ཆེ་དང་། སིལ་སྙན་གྱི་སྒྲ་དུ་མ་དག་ནི་སྒྲོགས་ཤིང་།
en: They raised sixty thousand flags and played sixty thousand instruments as well as many large drums and cymbals.

source: རྒྱལ་པོ་ཆེན་པོ་དེའི་མཐུས་གྲོང་ཁྱེར་ཆེན་པོ་མཉན་ཡོད་དུ་དོང་ངོ་།
en: With such royal pomp they went forth from the city of Śrāvastī.

source: །དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་བཞོན་པ་ལ་ཇི་སྲིད་བཞོན་དུ་རུང་བ་དེ་སྲིད་དུ་བཞོན་པས་སོང་སྟེ།
en: King Prasenajit of Kośala rode in his carriage as far as possible.

source: བཞོན་པ་ལས་བབས་ནས་ཡུལ་ན་མཐུ་དང་། བརྩོན་འགྲུས་ཐོབ་པ།
en: When he dismounted, he obtained power and dominion over that area.

source: རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བས་རྒྱལ་པོའི་རྟགས་ལྔ་པོ་གང་དག་ཡིན་པ་འདི་ལྟ་སྟེ།
en: What are the five royal insignia of a kṣatriya king who has been anointed on the crown of his head?

source: རལ་གྲི་རིན་པོ་ཆེ་དང་། གདུགས་རིན་པོ་ཆེ་དང་། ཅོད་པན་རིན་པོ་ཆེ་དང་། བསིལ་ཡབ་རིན་པོ་ཆེ་དང་མཆིལ་ལྷམ་ནོར་བུ་རིན་པོ་ཆེ་ལས་བྱས་པ་སྟེ།
en: They are the precious sword, the precious umbrella, the precious crown, the precious fan, and the precious jeweled shoes.

source: དེ་དག་ཐམས་ཅད་ཕུད་ཅིང་བཞག་ནས་རྐང་པས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་སོང་ངོ་།
en: He was presented with all those, and once he was adorned with them, he proceeded on foot to the Jeta Grove.

source: །དེ་ནས་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ན་སྒྲ་ཆུང་བར་རིག་ནས་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་དབྱིབས་རིང་ལ་སྨྲས་པ། དབྱིབས་རིང་འདི་ལྟར་འདི་ནི་བསམ་གཏན་པ་གནས་མེད་པ་རྣམས་ཀྱི་གནས་སོ།
en: Understanding that the Jeta Grove was a quiet place, King Prasenajit of Kośala said to his minister Long Shape, “Long Shape, this place is the abode of wandering meditators.

source: །རྣལ་འབྱོར་པ་དབེན་པ་ལ་དགའ་བ་རྣམས་དང་། སྟོང་པ་ཉིད་ལ་གནས་པ་རྣམས་དང་། མཚན་མ་མེད་པ་ལ་གནས་པ་རྣམས་དང་། སྨོན་པ་མེད་པ་ལ་གནས་པ་རྣམས་ཀྱི་གནས་སོ།
en: It is the abode of practitioners who enjoy solitude, who abide in emptiness, who abide in the absence of marks, and who abide in the absence of wishes.

source: །བསམ་གཏན་པ་མི་གནས་པ་རྣམས་ཀྱི་གནས་ཏེ།
en: It is the abode of nonabiding meditators.

source: ཕས་ཀྱི་རྒོལ་བ་རྣམས་ཀྱིས་ཀྱང་སྟོང་ལ་གནས་པ་རྣམ་པ་དེ་ལྟ་བུ་དེ་དག་དང་། སྒྲ་ཆུང་བ་དང་། དབེན་པ་འདིས་གནས་སོ།
en: It is a place that is free of opposing forces. In addition having to characteristics such as those, it is a quiet and remote place.”

source: །དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ས་ག་གཞོན་ནུ་དཔལ་ལ་སྨྲས་པ། ས་ག་གཞོན་ནུ་དཔལ་ངའི་འཁོར་རྣམས་གཅོམ་བསྐྱུངས་ཤིག །
en: So King Prasenajit of Kośala said to Youthful Splendorous Viśākha, “Youthful Splendorous Viśākha, please keep my retinue quiet.”

source: དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས། བཅོམ་ལྡན་འདས་ཐམས་ཅད་མཁྱེན་པ། ཐམས་ཅད་གཟིགས་པ། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ན་དགེ་སློང་གི་དགེ་འདུན་གྱིས་བསྐོར་ཏེ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་གྱིས་བལྟས་ཤིང་།
en: In the Jeta Grove, King Prasenajit of Kośala then beheld the all-knowing, all-seeing Blessed One surrounded by the assembly of monks.

source: ལྷའི་འཁོར་མང་པོས་བསྐོར་ནས་མདུན་གྱིས་བལྟས་པ་ལ་ཆོས་སྟོན་ཅིང་བཞུགས་པ་མཐོང་ངོ་།
en: He was seated and teaching the Dharma while being venerated by the assembly of monks and by many groups of gods.

source: །དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་སྐྱེས་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །
en: As joy and delight arose in King Prasenajit of Kośala, at that moment, he offered these verses:

source: སྣང་ཞིང་གསལ་བར་མཛད་པ་འོད་མཛད་པ།
en: “You shine, radiate, and sparkle.

source: །ཕས་ཀྱི་རྒོལ་བ་ཀུན་གྱིས་མི་གཡོས་ཤིང་།
en: You are unmoved by any opposition.

source: །འཁོར་གྱི་ནང་ན་ཟླ་བ་ཉ་བ་ལྟར། །གང་ཟག་དམ་པ་རྣམ་པར་ལམ་མེར་བཞུགས།
en: Holy one, you sit here among the assembly, Brilliant like the full moon. “

source: །ཆོས་ཀྱི་དམ་པ་སྟོན་པར་མཛད་པ་ན། །ཕྱོགས་བཅུ་ཀུན་ཏུ་ཁྱོད་ནི་ཐ་ལེ་ཞིང་།
en: When teaching the true Dharma, You are unobstructed in all ten directions.

source: །བདུད་ཀྱི་སྡེ་དཔོན་མ་ལུས་རབ་བཅོམ་ནས། །གསེར་གྱི་རི་བོ་འཕགས་བཞིན་ལམ་མེར་གདའ།
en: Having conquered every one of Māra’s generals, You shine brilliantly like a lofty golden mountain. “

source: །ཀླུ་ཡི་བདག་པོ་མི་གཡོས་གནས་པ་ལྟར། །གཽ་ཏ་མའི་ཉན་ཐོས་མི་ཕམ་ལགས།
en: Seated without moving like the king of the nāgas, The hearers of Gautama are invincible.

source: །ཞི་གནས་དགྱེས་ཀྱི་སྲས་རྣམས་ཞི་གནས་དགའ། །དེ་དག་ནང་ན་རྒྱལ་བ་གསུང་ཚེ་མཛེས།
en: Heirs who delight in tranquility, who enjoy tranquility— Victor, as you teach them, you are beautiful. “

source: །ཡོན་ཏན་ཡང་དག་སྟོན་པ་འཇིག་རྟེན་གྲགས། །དེ་ལྟར་རྒྱལ་བ་ཤཱཀ་ཐུབ་ལམ་མེར་བཞུགས།
en: Renowned in the world as a teacher with genuine qualities, Such is the way in which the Victor Śākyamuni shines.

source: །ཇི་ལྟར་རི་རབ་རྒྱ་མཚོའི་ནང་འཕགས་ཤིང་། །རིན་ཆེན་སྣ་ཚོགས་རྣམས་ཀྱིས་མཛེས་པ་ལྟར།
en: Mount Meru is raised above the oceans And adorned with a variety of precious things. “

source: །དེ་བཞིན་ཤཱཀྱ་ཁྱུ་མཆོག་འཇིག་རྟེན་འཕགས།
en: In the same way, the Śākya lord is raised above the world.

source: །སེམས་ཅན་ཀུན་ལས་ཁྱོད་འཕགས་ལམ་མེར་བཞུགས།
en: You are exalted among all beings, and you shine brilliantly.

source: །ཇི་ལྟར་པད་མ་ཆུས་ནི་མི་གོས་ལྟར། །དེ་བཞིན་འཇིག་རྟེན་དག་ན་མ་གོས་བཞུགས།
en: Just as the lotus is untainted by the lake, So are you untainted by the world. “

source: །ཇི་ལྟར་རི་རབ་རྟག་ཏུ་བརྒྱན་པ་ལྟར། །ཁྱོད་ནི་ཡང་དག་འཕགས་པས་ཀུན་ཏུ་མཛེས།
en: Just as Mount Meru is permanently adorned, So are you perpetually adorned due to your exalted nature.

source: །དེ་ལྟར་རྒྱལ་བ་མཁས་པ་རྣམས་ཀྱིས་བསྐོར།
en: Thus, the Victor is surrounded by wise ones.

source: །ལྷ་དང་བཅས་པའི་འཁོར་ནང་མངོན་པར་འཕགས།
en: Among this retinue that includes the gods, you are exalted. “

source: །སུམ་ཅུ་རྩ་གསུམ་གནས་ན་ཡོངས་འདུ་ཤིང་། །མེ་ཏོག་ལེགས་ཆས་འཕགས་མཛེས་ལྷག་གེ་ལྟར།
en: The wish-fulfilling tree in the Heaven of the Thirty-Three Is resplendent and beautiful with the finest flowers.

source: །དེ་བཞིན་ལྷ་དང་བཅས་པའི་འཁོར་ནང་ན། །ཤཱཀྱ་ཁྱུ་མཆོག་མཚན་གྱིས་རྣམ་པར་མཛེས།
en: In the same way, the Śākya leader is beautiful with the marks Among this retinue that includes the gods. “

source: །འོད་གསལ་ཟུར་བརྒྱད་ནོར་བུ་བཻ་དཱུརྱ། །དུ་གུལ་ཀ་ཤི་གོས་ཀྱི་སྟེང་བཞག་ན། །ཀུན་གྱིས་མི་གོས་ལྟ་བུར་དགྲ་བཅོམ་རྣམས།
en: If a clear, eight-faceted beryl gem Is placed on dukūla fabric from Kāśī, It will be completely unblemished.

source: །མེ་ལོང་བཞིན་དུ་སེམས་དག་དྲི་མ་མེད།
en: Likewise, the minds of worthy ones are stainless like a mirror. “

source: །ཁྱོད་ཀྱི་ཉན་ཐོས་དེ་དག་ནི། །བྱམས་པ་ཤིན་ཏུ་བསྒོམས་ནས་གནས།
en: Your hearers now abide With fully cultivated kindness.

source: །ཉན་ཐོས་བརྟན་རྣམས་ཡེ་ཤེས་དགའ།
en: Those stable hearers delight in wisdom.

source: །ཉོན་མོངས་མ་མཆིས་གདམས་ངག་སྟོན།
en: With no afflictions, they reveal the instructions. “

source: །རྒྱལ་པོ་འདིར་ནི་མཆིས་པ་ཡང་། །དེ་དག་རྣམས་ཀྱིས་མ་ཚོར་ལགས།
en: They do not even notice The king in their midst.

source: །གང་གི་ཉན་ཐོས་དེ་དག་ནི། །ཞི་ཞིང་ཆོས་ཀུན་མི་གནས་པ།
en: Those hearers of yours Are tranquil and do not dwell on any phenomena. “

source: །ཅང་མཁྱེན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: All-Knowing One, I bow down to you.

source: །སྐྱེས་མཆོག་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: Supreme human, I bow down to you.

source: །ཡེ་ཤེས་ཀྱིས་ནི་སྐུ་བསྒོམས་ཤིང་། །ཡེ་ཤེས་སྐུ་ཡིས་ཞུགས་པ་ལགས།
en: Your body was cultivated through wisdom; You now dwell in a wisdom body. “

source: །ཡེ་ཤེས་སྐུ་ཡིས་རྫོགས་སངས་རྒྱས། །སྐུ་ཡིས་ཟླ་བ་གསུམ་དུ་བཞུགས།
en: With your wisdom body you became a perfect buddha; With that body you rested for three months. “

source: །རྫོགས་སངས་རྒྱས་པ་སྨྲ་རྣམས་མཆོག །ཡེ་ཤེས་ལྡན་པ་རྟག་ཏུ་མཛེས།
en: The perfect buddhas make supreme statements; Endowed with wisdom, they are always beautiful.

source: །ཕྱི་མའི་དུས་ན་ཡེ་ཤེས་ལས། །ཉམས་འགྱུར་དགེ་སློང་རྣམས་ཀྱང་འབྱུང་།
en: However, in the future, there will be monks Who stray from wisdom. “

source: །རྒོད་ཅིང་དབང་པོ་ཕལ་པ་དང་།
en: They will be frivolous and have ordinary faculties.

source: །རྒོད་པའི་དགེ་སློང་མཁྱེན་ནས་ནི། །བསོད་སྙོམས་གཅིག་གིས་ཟླ་གསུམ་དུ། །རྒྱལ་བ་ཏིང་ངེ་འཛིན་ལ་བཞུགས།
en: Knowing about these frivolous monks, The Victorious One stayed in absorption For three months on merely a single alms meal. “

source: །ཕྱི་མའི་དུས་ན་ཟང་ཟིང་ལ། །བརྐམ་ཆགས་དགེ་སློང་རྣམས་འབྱུང་བས།
en: In the future, there will be monks Who will be desirous of material wealth.

source: །བསོད་སྙོམས་གཅིག་གིས་ཟླ་གསུམ་དུ། །རྒྱལ་བ་ཏིང་ངེ་འཛིན་ལ་བཞུགས།
en: Therefore, the Victorious One stayed in absorption For three months on merely a single alms meal. “

source: །ཕྱི་མའི་དུས་ཀྱི་དགེ་སློང་ཕྱིར། །ཁྱོད་ཀྱིས་དེ་སྐད་བཀའ་སྩལ་ཏེ།
en: For the sake of future monks, You have spoken those words.

source: །དེ་ཚེ་གང་དག་དད་པ་རྣམས། །བསྟན་པ་འདི་ལ་བསླབས་པ་འབྱུང་།
en: At that time, those with faith Will train in this teaching. “

source: །སེམས་ཅན་གང་དག་མ་དད་པ། །ཆོས་འདི་དག་ནི་ཐོས་ནས་ཀྱང་། །དེ་དག་དགའ་བར་མི་འགྱུར་བས།
en: There are those who have no faith And do not feel delight Even after they hear these teachings.

source: །དེ་དག་བསྐུལ་ཕྱིར་འདི་མཛད་དོ།། །།
en: You still act to encourage them.”

source: དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: King Prasenajit of Kośala went up to the Blessed One and bowed down before him.

source: བཅོམ་ལྡན་འདས་ལ་དང་བའི་སེམས་ཀྱིས་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: He bowed down again with his mind filled with devotion.

source: དང་བའི་སེམས་ཀྱིས་བཅོམ་ལྡན་འདས་མཐོང་ནས། ཡང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ནི་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་ལགས་སོ།
en: As he beheld the Blessed One in a state of trust, he bowed down again and spoke to the Blessed One, “Blessed One, I am the king of Kośala.

source: །བཅོམ་ལྡན་འདས་བདག་ནི་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་ལགས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ལགས་སོ།
en: Blessed One, I am the king of Kośala, and I bow down to you.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་ལ་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོས་བཀུར་སྟི་བྱས་པ་དང་། རི་མོ་བྱས་པ་དང་།
en: The Blessed One said to King Prasenajit of Kośala, “Great king, you have shown respect and veneration, and you have performed worship.

source: མཆོད་པ་བྱས་པས་ཆོག་གིས་ལོངས་ཤིག །
en: That is sufficient, so now rise.

source: ལོངས་ལ་རྒྱལ་པོ་ཆེན་པོ་རང་གི་སྟན་ལ་འདུག་ཤིག །
en: Rise, great king, and sit on your seat.”

source: དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་སྤྱན་སྔ་ན་འདུག་ཅིང་། བཅོམ་ལྡན་འདས་ལ་མིག་མི་འཛུམས་པས་བལྟས་སོ།
en: King Prasenajit of Kośala sat before the Blessed One and gazed upon him with unblinking eyes.

source: །བལྟས་ནས་ཀྱང་རིན་པོ་ཆེའི་གོས་རིན་ཏང་མེད་པ་ལག་ན་ཐོགས་ཐོགས་པ་དང་།
en: Having looked upon the Blessed One, he first held up the precious and priceless clothing.

source: རང་གི་ལུས་ལ་གོས་གྱོན་གྱོན་པ་གང་ཡིན་པ་དེ་ལུས་ལས་ཕུད་དེ་བཅོམ་ལྡན་འདས་ལ་ཕུལ་ལོ།
en: He then removed his own clothes that he was wearing and offered them all to the Blessed One.

source: །ཕུལ་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གི་གོས་རིན་པོ་ཆེ་འདི་ནི་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལས་གྲུབ་པ།
en: After making this offering, he said to the Blessed One, “Blessed One, these precious garments of mine are the result of the ripening of past actions.

source: མ་སྨད་པ། བཟང་བ། ཁ་ན་མ་ཐོ་བ་མ་མཆིས་པ། རང་གི་ལུས་ལ་འཚལ་འཚལ་བ་ལགས་ཏེ།
en: They are irreproachable, excellent, without faults, and pleasant to wear.

source: འདི་བདག་གི་དབང་ཕྱུག་གིས་སུ་ལས་ཕྲོགས་པ་ཡང་མ་མཆིས་ཀྱི།
en: They have not been taken from anyone by means of my power.

source: སྔོན་ལེགས་པར་སྤྱད་པ་ལས་མངོན་པར་གྲུབ་པ་ལགས་ན། བཅོམ་ལྡན་འདས་ཀྱིས་བཞེས་སུ་གསོལ།
en: Since they are the result of previous good conduct, Blessed One, please accept them.”

source: དེ་ནས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ། འདི་ལྟར་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་འདིས་གོས་རིན་པོ་ཆེ་ཡོངས་སུ་སྤྱད་སྤྱད་པ་འདི་བཅོམ་ལྡན་འདས་ལ་ཕུལ་ལོ་སྙམ་མོ།
en: The householder Anāthapiṇḍada thought, “The king of Kośala is offering to the Blessed One these precious garments that he has already used.”

source: །དེ་ནས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱི་སེམས་ཀྱི་རྟོག་པ་སེམས་ཀྱིས་ཤེས་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གི་གོས་རིན་པོ་ཆེ་འདི་སྔ་ནས་བཅོམ་ལྡན་འདས་ལ་དབུལ་ལོ་སྙམ་པའི་སེམས་དེ་ལྟ་བུ་ནི་མ་སྐྱེས་ལགས་ཀྱི།
en: Due to the Blessed One’s power, King Prasenajit of Kośala knew the householder Anāthapiṇḍada’s thoughts, so he said to the Blessed One, “Blessed One, I had not previously thought to offer my precious clothing to the Blessed One.

source: བཅོམ་ལྡན་འདས་མཐོང་ནས་ནི་སེམས་སྐྱེས་ལགས་ན་ཐུགས་བརྩེ་བའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་གོས་རིན་པོ་ཆེ་འདི་བཞེས་སུ་གསོལ།
en: Rather, the intention arose upon seeing the Blessed One. Hence, Blessed One, please accept these precious garments out of your kindness.

source: བཅོམ་ལྡན་འདས་སེམས་འདི་ནི་མྱུར་དུ་འགྱུར་བ་ལགས་ལ།
en: Blessed One, this idea just came to me quickly.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་རྙེད་པར་དཀའ་སྟེ། ཨུ་དུམ་བ་རའི་མེ་ཏོག་བཞིན་དུ་མཆོག་ཏུ་རྙེད་པར་དཀའ་བས་དབུལ་ལོ་སྙམ་པ་དེ་སྐྱེས་ལགས་སོ།
en: Blessed One, I thought to make this offering because it is so rare to meet the thus-gone ones, as rare as the uḍumbara flower.

source: །བདག་གིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །ཁྱོད་ནི་རྐང་གཉིས་གཙོ་བོ་སྟེ། །བསོད་ནམས་གཟི་བརྗིད་ཀུན་ཏུ་འཕགས།
en: I now offer these verses so that I may please the Blessed One: “You are the supreme person, With exalted merit and splendor.

source: །ཉོན་མོངས་ཅན་སེམས་མ་གཏོགས་པར། །མཐོང་ན་དགའ་བ་སུ་མི་སྐྱེད། །སེམས་ཅན་མ་རུངས་གང་དག་གིས།
en: Apart from those with an afflicted mind, Who could not be filled with joy upon seeing you? “

source: །ཐུབ་དབང་མ་མཆོད་དེ་དག་བརླག །
en: Those vile beings who do not pay homage To the King of Sages are ruined.

source: ཨུ་དུམ་བ་རའི་མེ་ཏོག་ལྟར། །གསལ་མཛད་འཇིག་རྟེན་དག་ན་དཀོན།
en: In this world, such splendor as yours Is as rare as the uḍumbara flower. “

source: །ཤཱཀྱ་སེང་གེ་མི་ཡི་མཆོག །མགོན་པོ་བདག་གིས་དེང་མཉེས་ཀྱིས། །ཡེ་ཤེས་ལ་ནི་བདག་སྨོན་པས།
en: Lion of the Śākyas, supreme human, Protector, with great pleasure I now make the aspiration for wisdom.

source: །ཁྱོད་ལ་དེང་ནི་མཆོད་པ་བགྱིད།
en: Today I make this offering to you. “

source: །བྱང་ཆུབ་ཡེ་ཤེས་གང་འདོད་པ། །སངས་རྒྱས་རྣམས་ལ་མཆོད་འདི་ལགས།
en: This offering to the buddhas Is for those who desire the wisdom of awakening.

source: །སངས་རྒྱས་ཡེ་ཤེས་ཆེད་ཀྱི་ཕྱིར། །མི་མཆོག་ལ་ནི་མཆོད་བགྱིད་ན།
en: It is for the sake of the wisdom of the buddhas That I make an offering to the supreme human. “

source: །མགོན་པོ་བདག་གིས་བཞེས་སུ་གསོལ།
en: Protector, please accept my offering!

source: །རྒྱལ་བ་བདག་གིས་བཞེས་སུ་གསོལ།
en: Victor, please accept it!

source: །སེམས་ཅན་ཀུན་གྱི་དོན་སླད་དུ། །ཁྱོད་ལ་བདག་ནི་ན་བཟའ་འབུལ།
en: It is for the sake of all beings That I offer these garments to you. “

source: །བདག་གིས་སེམས་ནི་ཚར་བཅད་ཅིང་། །བདག་གིས་སེར་སྣ་བཅོམ་པས་ན། །ཆོས་རྣམས་བསྐྱེད་པའི་ཆེད་ཀྱི་ཕྱིར། །བདག་གིས་སེམས་ལ་གཏོང་བ་སྐྱེས།
en: It is because I have tamed my mind And conquered stinginess That I developed the wish to give For the sake of producing qualities.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ན་བཟའ་ཕུལ་བ་བཞེས་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One accepted the garments that had been offered by King Prasenajit of Kośala and said,

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་སེམས་བསྐྱེད་པ་རྒྱ་ཆེན་པོ་སྐྱེས་པ་ལེགས་སོ་ལེགས་སོ། །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཕྱིར་ཆོས་བཞི་པོ་དག་ལ་བརྩོན་པར་བྱ་སྟེ།
en: “Great king, it is excellent that such a vast intention has arisen in your mind! Excellent! Great king, for that reason you should exert yourself in four principles.

source: བཞི་གང་ཞེ་ན། རྒྱལ་པོ་ཆེན་པོ་འདི་ལྟ་སྟེ། རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་ཡུལ་ན་མཐུ་དང་བརྩོན་འགྲུས་ཐོབ་པས་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་ཚུལ་ཁྲིམས་དང་ལྡན་པའི་ཐད་དུ་འགྲོ་བར་བྱ་ཞིང་ཡོངས་སུ་དྲི་བར་བྱ་བ་དང་།
en: Great king, those four are as follows: (1) When a kṣatriya king has been anointed on the crown of his head and receives power and dominion in that land, he must go before monks and brahmins who maintain discipline and ask questions of them.

source: དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་བསྲུང་བ་དང་བསྐྱབ་པའི་ཕྱིར་བསྒྲུབ་པར་བྱ་བ་དང་།
en: (2) In order to protect and safeguard the teachings of the thus-gone ones, he must accomplish them.

source: ཟབ་མོ་ལ་མོས་པས་ཆོས་བཙལ་བར་བྱ་བའི་ཕྱིར་སྤྲོ་བར་བྱ་བ་དང་།
en: (3) He must be determined to pursue the Dharma out of a desire for the profound.

source: ལོག་པར་ལྟ་བ་དང་བྲལ་བས་ཡང་དག་པ་ཉིད་དུ་ངེས་པར་བྱ་བའི་ཕྱིར་སྤྲོ་བར་བྱ་བ་སྟེ།
en: (4) He must be determined to gain certainty about the true state by being free of wrong views.

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་ལ་བརྩོན་པར་བྱའོ། །
en: Great king, you must exert yourself in those four principles.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བདེ་བར་གཤེགས་པས་དེ་སྐད་གསུངས་ཏེ། སྟོན་པས་གཞན་ཡང་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: When the Blessed One had spoken those words, when the Well-Gone One finished that teaching, he, the Teacher, continued:

source: དགེ་སློང་ཚུལ་ཁྲིམས་ལྡན་རྣམས་ལ། །གུས་པ་དག་ནི་རྟག་བྱེད་ཅིང་། །དངོས་པོ་ཀུན་གྱིས་འདྲི་བྱེད་པ།
en: “Always show respect For the monks who observe discipline, And inquire about all things.

source: །དེས་ནི་ཤེས་རབ་རྣམ་པར་འཕེལ།
en: That way, insight will flourish. “

source: །དགེ་སློང་རྣམས་ལ་གུས་པ་དག །བྱས་པའི་ལས་ནི་དགེ་བ་ཡི།
en: Showing respect for monks Is a virtuous act.

source: །ཇི་ལྟར་དག་པ་དེ་བཞིན་དུ། །དེ་ཡི་སེམས་ནི་དག་པར་འགྱུར།
en: To the extent that it is pure, One’s mind will be pure. “

source: །བསྟན་པ་བསྲུང་བ་བྱས་པ་ནི། །རྟག་ཏུ་ཀུན་ནས་བསྲུང་བ་ཡིན།
en: Protecting the teachings means Constant protection.

source: །ཡན་ལག་དང་པོ་འདི་ཡིས་ནི། །ལུས་ནི་ངེས་པར་དག་པར་འགྱུར།
en: Through this primary aspect, One’s body will be truly pure. “

source: །རྒྱལ་རིགས་དག་གིས་ཟབ་མོའི་ཆོས། །རྟག་ཏུ་ཉན་ཅིང་འདུག་བྱེད་ན། །ཕྱིར་ཞིང་ཐོས་པར་འདོད་འགྱུར་ཞིང་། །ཡང་དང་ཡང་དུ་ཚོལ་བར་འགྱུར།
en: When kṣatriyas take a seat To listen carefully to the profound Dharma, They will desire to hear it again And will pursue it repeatedly. “

source: །ཟབ་མོའི་ཆོས་ནི་ཐོས་ནས་ཀྱང་། །ལོག་པ་དག་ནི་སྤྱོད་མི་བྱེད།
en: Having heard the profound Dharma, One does not take a wrong path.

source: །རྒྱལ་པོ་ལོག་པར་ལྟ་བྲལ་ཞིང་། །ཡང་དག་ཆོས་ནི་ཤེས་པར་འགྱུར།
en: King, thus free of wrong views, You understand the true Dharma. “

source: །ཟབ་མོའི་ཆོས་ནི་ཤེས་ནས་ཀྱང་། །དེ་ནི་ལོག་པར་མི་སྤྱོད་ཅིང་། །སྡིག་པ་ཀུན་དང་བྲལ་བས་ན།
en: Once one understands the profound Dharma, One will no longer be mistaken But will abstain from evil deeds.

source: །དེས་ན་རྒྱལ་པོ་ཁྱད་པར་འཕགས།
en: Thus, king, one becomes exalted. “

source: །ཆོས་ཀྱི་དམ་པ་བཞི་པོ་ལ། །རྒྱལ་རིགས་བཞི་པོ་རྟག་པར་ནི།
en: With these four superior principles One will always be among the four royal castes.

source: །འགྲོ་བ་ངན་པར་དེ་མི་འགྲོ།
en: One will not fall to the lower realms.

source: །དེ་ལ་བདེ་འགྲོ་རྙེད་མི་དཀའ།
en: Therefore, the higher realms will not be hard to find. “

source: །སངས་རྒྱས་མྱུར་དུ་མཐོང་འགྱུར་ཞིང་། །དེ་ལས་ཆོས་ཀྱང་ཉན་བྱེད་ལ། །
en: One will quickly meet a buddha And listen to the teachings from him.

source: རྫོགས་སངས་རྒྱས་ཀྱིས་བཤད་པ་ཡི། །ཟབ་མོའི་ཆོས་ནི་ཤེས་པར་འགྱུར།
en: Thus, one will understand the profound Dharma As it is spoken by a perfect buddha. “

source: །ཆོས་བཞི་དག་ལ་རྟེན་བྱེད་ཅིང་། །སེམས་ཀྱིས་བྱང་ཆུབ་སྔོ་བྱེད་ན། །ཡར་གྱི་ངོ་ཡི་ཟླ་བ་ལྟར། །དེ་ཡི་ཡེ་ཤེས་འཕེལ་བར་འགྱུར།
en: If one engages in the four principles And dedicates one’s mind toward awakening, Then, just like the waxing moon, One’s wisdom will increase. “

source: །སེམས་ཀྱིས་བྱང་ཆུབ་སྔོ་བྱེད་ཅིང་། །ཆོས་མཆོག་དག་ནི་ཚོལ་བྱེད་ན། །རྐང་གཉིས་དམ་པ་རྫོགས་སངས་རྒྱས། །འཇིག་རྟེན་དམ་པར་དེ་འོས་སོ།
en: If one dedicates one’s mind toward awakening And pursues the supreme teachings, One is worthy of becoming supreme in the world, The most excellent of humans, a perfect buddha. “

source: །ཆོས་ནམས་ཀུན་གྱི་དམ་པ་སྟེ། །ཆོས་མཆོག་དག་ནི་སྟོན་པ་པོ། །དེ་ལ་མཆོད་པ་བྱས་ནས་ནི། །ཐེག་པ་མཆོག་ཏུ་ངེས་པར་འགྱུར།
en: The teacher of the supreme Dharma, The most holy among all teachings— By making offerings to that person, One will surely be brought to the supreme vehicle. “
